Revit 2027 API
SharedParameterApplicableRule Constructor
 Constructs an instance of SharedParameterApplicableRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SharedParameterApplicableRule(
	string parameterName
)
Public Sub New (
	parameterName As String
)
public:
SharedParameterApplicableRule(
	String^ parameterName
)
new :
        parameterName : string -> SharedParameterApplicableRule
Parameters
parameterName String
 The name of the parameter that an element must support to pass this rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SharedParameterApplicableRule Class
Autodesk.Revit.DB Namespace